//
//  webDesign.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 
 ВЕБ-ДИЗАЙН
 
 
 Курсы дизайна — комплексная программа обучения, которая поможет вам освоить веб-дизайн с нуля. Занятия предполагают большое количество практического материала, чтобы вы сразу же могли закрепить полученные знания. Пройдя курсы веб-дизайна, вы научитесь работать с популярными графическими редакторами, создавать логотипы и работать с элементами фирменного стиля. После комплексной программы обучения вы будете обладать всеми необходимыми знаниями и навыками для того, чтобы понимать, каким будет итоговый продукт и будет ли он соответствовать ожиданиям конечного заказчика.
 После изучения курса Вы сможете:
 Использовать основные элементы и паттерны интерфейсов
 Создавать собственные библиотеки элементов
 Анализировать и разбираться в UX Research
 Разрабатывать и внедрять эффективные дизайн-решения
 Создавать красивые и удобные продукты (брендбук, лендинги, шрифты, иконки, анимации, логотипы и так далее)
 Создавать дизайн веб-макета от прототипа до полной подготовки к верстки
 Понимать, как строится стиль бренда и уметь придерживаться его при проектировании дизайн-макета
 Понимать принципы верстки и создавать “гибкие” дизайн-решения
 
 Основы дизайна и графические редакторы
 
 
 Описание курса
 Хотите научиться работать с векторными и растровыми изображениями, ретушировать фотографии, создавать Gif-анимации и подготавливать дизайн-макеты к верстке вебсайтов? Тогда этот курс именно для Вас!

  

 После курса вы сможете:
 Работать в графических редакторах Adobe Photoshop, Adobe Illustrator, Figma/Sketch
 Редактировать изображения и рисовать простые макеты сайтов
 Готовить макеты для верстки веб-сайтов и основам допечатной подготовки.
 
 Программа курса:
 Знакомство и возможности программы Adobe Photoshop. Создание и сохранение файлов
 Понятие «Растровое изображение». Отличия между растровым и векторным изображением. Области применения
 Виды цветовых моделей. Особенности и области применения различных цветовых моделей
 Интерфейс, настройка рабочего пространства
 Создание нового изображения. Изменение основных параметров изображений
 Работа со слоями
 Понятие слоя. Виды слоев. Меню «Слой» («Layer»)
 Способы создания слоя. Работа со слоями. Параметры слоя
 Управление слоями с помощью палитры «Layers»
 Особенности работы с многослойным изображением
 Выделение и связывание нескольких слоев. Трансформация содержимого слоя
 Операции со слоями. Слияние слоев. Группировка
 Стили для слоев
 Инструменты выделения. Меню Выделение (Select)
 Назначение различных инструментов выделения, настройка параметров
 Трансформация формы выделения. Дополнение, вычитание и пересечение областей выделения
 Растушевка границы области выделения
 Выделение мягких и жестких форм
 Инструмент «Уточнить край» и коррекция выделенной области
 Действия с выделенной областью: перемещение, дублирование, масштабирование, поворот, искажение выделенной области
  Цветокоррекция
 Подготовка к цветокоррекции
 Базовая цветокоррекция. Команды тоновой и цветовой коррекции. Команды «Быстрой» коррекции
 Использование корректирующих слоев
 Преобразование цветной фотографии в черно-белую
 Ретушь фотографии
 Этапы ретуши фотографий (портрет)
 Чистка и восстановление деталей изображения с помощью инструментов «Clone Stamp», «Spot Healing Brush», «Healing Brush». Чистка кожи
 Цветокоррекция отдельных участков изображения. Изменение насыщенности Осветление и затемнение участков изображения. (отбеливание зубов, замена цвета глаз и волос)
 Добавление элементов изображения (волосы)
 Фильтр «Liquify» и коррекция фигуры
 Использование инструмента «History Brush»
 Работа с текстом
 Создание текстового слоя
 Деформация надписи
 Создание огненного текста при помощи эффектов слоя
 Работа со стилями. Как установить стили. Применение стилей и их коррекция. Создание железного текста.
 Работа с междустрочным и межбуквенным расстоянием, изменение высоты строк. Создание текстовых композиций
 Работа с mock-up
 Изображения для социальных сетей, веб страниц
 Размеры, разрешения, форматы
 «Smart Filters»
 Сохранение элементов дизайна для веб
 Анимация
 Работа с шкалой времени
 Рабочая среда Adobe Illustrator. Основные операции с документом
 Основные элементы окна Adobe Illustrator CS. Палитры. Главное меню. Контекстные меню
 Работа с документами. Создание, сохранение, открытие документа. Восстановление предыдущей версии документа. Шаблоны документов
 Режимы просмотра документа Масштабирование. Навигация по документу
 Отмена и повторение последних действий
 Создание простых объектов и их трансформация
 Создание простых фигур: прямоугольники, эллипсы, многоугольники, звезды, линии, дуги, спирали, сетки
 Выделение объектов. Инструменты выделения
 Трансформация объектов
 Перетекание объектов. Перетекания на траектории. Параметры перетекания
 Манипулирование объектами
 Перемещение объектов. Перемещение объектов между документами. Размещение объектов
 Создание копий и дубликатов объектов
 Группирование и разгруппирование объектов. Выделение объектов в группе. Блокирование и разблокирование объектов
 Операции компоновки и комбинирования объектов
 Выравнивание объектов
 Невидимые объекты
 Удаление объектов
 Подготовка изображений для веба
 Подготовка изображений для размещения на сайтах
 Подготовка макетов для верстки сайтов
 Вспомогательные средства Adobe Illustrator CS
 Вспомогательные средства для точного рисования
 Атрибуты отображения объекта. Линейки. Единицы измерения шкалы линеек
 Направляющие. Создание направляющих. Перемещение и поворот направляющих. Удаление направляющих. «Умные» направляющие. Создание направляющей из объекта
 Редактирование линий, контуров и формы объектов
 Рисование линий
 Типы кистей. Работа с кистями. Библиотека кистей
 Инструмент Безье. Структура кривой и контура фигуры. Выделение, редактирование перемещение узлов. Редактирование кривой и контура фигуры
 Контроль параметров объектов, уменьшение количества узлов
 Слои. Маски
 Понятие слоя. Создание нового слоя. Работа с палитрой «Layers». Использование слоев для блокировки частей рисунка
 Типы масок. Создание масок. Добавление объектов к группе маскирования. Создание маски с помощью палитры «Layers». Отмена маскирования
 Маски непрозрачности. Создание и редактирование маски непрозрачности
 Работа с текстом
 Текст и его параметры. Шрифт и его атрибуты. Инструменты и палитры для работы с текстом
 Импортирование текста из других приложений
 Трансформация и преобразование текстовых элементов
 Размещение текста вдоль кривой. Редактирование кривой
 Преобразование текстовых символов в набор кривых
 Художественное оформление текстовых элементов. Создание теней. Неоновый эффект
 Фильтры и эффекты программы
 Эффекты и их отличие от фильтров
 Работа с растровыми изображениями
 Операции с растровыми изображениями. Размещение растрового изображения в документе. Особенности работы с растровыми изображениями
 Трансформация растровых изображений. Искажение растровых изображений
 Преобразование растровых изображений в векторные. Преобразование векторных изображений в растровые
 Палитра «Links»
 Кадрирование растровых изображений
 Подготовка изображений к публикации в Web
 Экспорт документов в форматы для Web и их сохранение. Формат JPEG. Формат GIF. Формат PNG. Формат SVG. Диалоговое окно Save for Web
 Подготовка макета к печати
 Вылеты. Внутренние отступы. Проверка цвета. Композитный черный. Особенности подготовки файлов для цифровой и офсетной печати
 Работа с типографией. Основные требования типографий. Что уточнять у печатника
 Отправка исходного файла. Подготовка макета для передачи
 Работа дизайнером
 Работа дизайнером: как начать. Портфолио. Скорость работы. В чем себя попробовать. Профессиональные ресурсы для дизайнеров
 Авторские права. Работа со стоками
 Интерфейс Figma
 Основные элементы окна. Главное меню.
 Инструменты
 Работа со слоями, маски.
 Работа с документами.
 Интерфейс Sketch
 Основные элементы окна. Главное меню.
 Инструменты
 Работа со слоями, маски.
 Работа с документами
 Установка плагинов
 
 
 
 
 */
