//
//  c#NetDevelopment.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/* C# /.NET DEVELOPMENT
 
 Курс С# — это комплексная программа обучения языка С# с нуля, которая включает широкий диапазон практических занятий, на которых вы научитесь работать со сборками, пространствами имен и рефлексией, узнаете о сериализации и коллекции, ограничении в обобщении, ознакомитесь с делегатами и событиями, а также научитесь правильно проводить стандартные операции запросов, фильтрацию, сортировку и группировку;Язык C# — это язык ООП, которая широко используется для разработки надежных и устойчивых приложений для Windows, Windows Mobile, а также для программирования игр с использованием Unity.При условии успешного окончания курса С#, вы получите предложение пройти стажировку с возможностью дальнейшего трудоустройства в одной из компаний-партнеров ITEA.
 После изучения курса Вы сможете:
 Использовать основные структуры данных для разработки программ
 Использовать ООП-методологии для разработки программ
 Создавать простые приложения на C#, используя классы со сложной иерархией
 Работать с интерфейсами и модификаторами доступа
 Разбираться в уже написанных приложениях
 Быть самостоятельным C#-программистом как в команде разработчиков, так и на фрилансе
 Уметь разбивать большие задачи на отдельные процессы, планировать и правильно оценивать время для выполнения задач
 
 
 
 
 */
