//
//  cPlusPlus.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 
 C++
 
 Курсы программирования на C++ — комплексная программа обучения одному из самых популярных и мощных языков программирования, С ++.
 Обучение состоит из взаимосвязанных этапов, после которых ты овладеешь основами программирования на базовом и продвинутом уровнях. Программа C ++ предусматривает получение hard skills и soft skills, необходимых Junior-специалисту.
 Язык С ++ ( «си плюс плюс») широко используется при создании программного обеспечения: прикладных программ, драйверов, развлекательных, офисных приложений, приложений для встраиваемых устройств, операционных систем.
 Специалистов, которые знают программирование С ++, на современном IТ-рынке немного, поэтому востребованность в таких программистах стабильная.
 Преподаватели-практики помогут тебе стать профессионалом в программировании C++ и получить работу своей мечты.
 После изучения курса Вы сможете:
 Использовать основные структуры данных для разработки программ
 Использовать ООП-методологии для разработки программ
 Разрабатывать консольные приложения в операционной системе Linux
 Работать со стандартной библиотекой С++ и библиотекой Qt
 Создавать GUI-приложения
 Работать программистом C++ и в команде разработчиков, и на фрилансе
 Уметь разбивать задачи на отдельные процессы, эффективно планировать время на выполнение задач
 
 
 
 */
