//
//  javaProgramming.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation


/* Курсы программирования Java — современная комплексная программа обучения языку Java.
Java – популярный язык программирования, на котором кодят игровые и мобильные приложения, десктоп-программы и огромное количество soft-продуктов для предприятий.
Программа обучения Java состоит из взаимосвязанных уровней, после изучение которых вы получите знания и навыки Java-разработки уровня Junior-специалиста.
Java-разработчик – это перспективно и выгодно. IТ-компании предлагают начинающему разработчику зарплату от 300 $, комфортные условия труда, интересные проекты и карьерный рост! Пройдя Java-обучения вы получите работу своей мечты!
После изучения курса Вы сможете:
Разрабатывать приложения и внедрять аппликации в рамках платформы JavaSE
Использовать основные элементы и конструкции языка JavaSE, архитектурные и проектировочные приемы в рамках платформы
Писать загрузчики классов
Разрабатывать небольшие IoС-контейнеры
Писать модульные тесты и работать по TDD
Понимать, что скрывается за понятием Java Memory Model*/
