//
//  jsDevelopment.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

/*
 
 
 програмироваие
 
 
 JS DEVELOPMENT
 js development
 
 Курсы JS development — комплексная программа обучения программированию на языке JavaScript с нуля.
 Язык JavaScript популярен и прост в использовании. Он широко применяется в браузерах для создания интерактивных веб-страниц, для разработки назначения пользовательских интерфейсов с помощью фреймворков.
 Roadmap JS development состоит из взаимосвязанных направлений, которые помогут овладеть основами JS-разработки и стать специалистом уровня junior.
 Специальность JavaScript developer – востребована как на биржах фриланса, так и в крупных IТ-компаниях. Зарплаты Java Script-разработчиков стартуют от 300 $! Удобные условия работы, гибкий график, комфортные офисы, корпоративное обучение, рост зарплаты – все это преимущества специализации JS-разработчика.
 Уроки состоят из 70% практики и 30% теории. Преподаватели курса – опытные программисты из ведущих компаний IТ, расскажут о неписаных правилах и секретах успешной JavaScript-разработки.
 
 
 После изучения курса Вы сможете:
 Понимать прототипно-ориентированную модель программирования JavaScript
 Работать с массивами, функциями, объектами, условными и цикличными конструкциями
 Работать с технологией AJAX
 Работать с ООП в JavaScript
 Проверять и рефакторить код на предмет ошибок
 Создавать плагины JavaScript
 Создавать и оптимизировать быстрые и плавные анимации для браузеров
 Ускорять работу и процесс загрузки страницы
 Создавать Angular-приложения
 Создавать приложения на Node.js
 Создавать веб-сервисы на express.js
 Работать с веб-сокетами с помощью socket.io
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */



