//
//  dataScience.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 DATA SCIENCE/MACHINE LEARNING
 
 Data Science/Machine Learning — комплексная программа обучения, что призвана помочь специалистам решать задачи по сбору и анализу больших объемов информации с применением концепций Data Science и Machine Learning. На сегодняшний день это одно из самых прогрессивных направлений в сфере информационных технологий в виду необходимости обработки все большего количества данных и извлечения из них полезных свойств. После прохождения программы обучения вы будете иметь представление о технологии BigData, научитесь исследовать предметную область знаний и применять к ее обработке методы машинного обучения.
 После изучения курса Вы сможете:
 Принимать правильные бизнес решения при помощи Data Science и Machine Learning
 Применять концепции сбора, подготовки, исследования и визуализации данных
 Использовать современные методы машинного обучения для решения задач прогнозирования и классификации данных
 Сегментировать большие объемы данных при помощи алгоритмов машинного обучения
 Работать с основными инструментами Data Science
 Строить системы машинного обучения на основе данных большого объема с использованием BigData
 */
