//
//  python.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 
 Курсы Python — комплексная программа обучения языку программирования Рython.
 Рython ориентирован на повышение продуктивности фронтенда и читабельности его кода. Язык прост в использовании, но в то же время его библиотека насчитывает большой выбор полезных функций, необходимых для создания веб-дизайна.Курс Python состоит из четырех направлений:
 • Базовый курс Python (уроки python с нуля знакомят начинающих разработчиков с основами программирования на данном языке).
 • Углубленный курс Python позволит вам полноценно использовать язык питон для написания программ.
 • Курс Python для Data Science предназначен для раскрытия функционала языка в рамках обработки больших объемов данных и машинного обучения.
 • Веб-разработка на Python / Django дает возможность профессионально разрабатывать коммерческие веб-приложения, используя Django-фреймворк
 Наши преподаватели – опытные специалисты из IТ-компаний, предлагают комплексный подход к изучению среды разработки Рython. Курс занятий эффективно объединяет теоретические основы обучения с их практическим применением. Кроме овладения профессиональными навыками работы с Рython, обучение предполагает прокачку и soft skills, которые помогут эффективно использовать личностный и творческий потенциал разработчика.
 Окончив курс Python с высокими баллами, вы можете получить предложение пройти стажировку с возможностью дальнейшего трудоустройства в топовых компаниях IТ-рынка.
 После изучения курса Вы сможете:
 Понимать принципы программирования
 Проектировать структуру программ
 Создавать программы среднего уровня сложности на языке Python
 Создавать небольшие инструментальные программы
 Разрабатывать зрелые программы на языке Python
 
 
 */
