//
//  Cisco.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation





/*
 CISCO
 
 
 
 Вечерние курсы линейки Cisco —  это комплексная программа подготовки специалистов по внедрению и поддержке сетей IPv4 и IPv6. Вы получите начальные навыки работы с сетями малого и среднего размера. Программа включает в себя необходимый пласт знаний для сдачи экзамена и получения сертификата уровня CCNA Routing & Switching. CCNA Routing & Switching —  базовый уровень сертификации CIsco, подтверждающий умение собирать LAN и WAN сети и настраивать удаленный доступ.
После изучения курса Вы сможете:
Устанавливать сети среднего размера и управлять ими;
Использовать протоколы IP, IGRP, Serial, Frame Relay и др.;
Настраивать безопасные соединения в сетях;
Сдать экзамен и получить сертификат CCNA. (экзамен не входит в стоимость курса)
 
 
 ICND 1. Использование сетевого оборудования Cisco
 
 Описание курса
 Курс ICND 1 направленный на понимание принципов работы IPv4 и IPv6 сетей и их построение. 90% курса сосредоточено на практических занятиях, в программе 22 лабораторные работы, после завершения которых вы сможете тут же применять полученные навыки для решения реальных задач. Окончив курс вы сможете с нуля собрать небольшую сеть, обеспечить подключение к интернету и наладить ее бесперебойную работу, а при необходимости —  масштабировать до сети среднего размера. Аудитория курса: инженеры поддержки, сетевые инженеры, технические специалисты и сетевые администраторы.
 После курса вы сможете:
 Описывать основные компоненты и функции сети
 Построить простую сеть
 Обеспечить подключение сети предприятия к сети Интернет
 Обеспечивать безопасную работу сетевых устройств
 Обеспечить масштабирование малой сети предприятия до сети среднего размера за счет применения WAN технологий
 Описывать основные принципы работы IPv6 сетей
 Программа курса:
 Модуль 1. Построение простой сети
 Описание простой локальной сети
 Описание взаимодействия конечных устройств через сетевую инфраструктуру
 Введение в описание и работу локальных сетей
 Введение в операционную систему компании Cisco Systems IOS
 Начало работы с коммутаторами Cisco серии Catalyst
 Лабораторная работа № 1-1 Начало работы с операционной системой IOS
 Начальные конфигурации коммутатора
 Лабораторная работа № 1-2 Начальные конфигурации коммутаторов Catalyst
 Описание работы технологии Ethernet, а также работы коммутатора по обслуживанию Ethernet кадров
 Лабораторная работа №1-3 Обзор работы коммутатора
 Выявление и устранение проблем на Ethernet каналах
 Лабораторная работа №1-4 Выявление и устранение проблем в работе портов коммутатора и каналах связи
 Модуль 2. Подключение локальной сети к сети Интернет
 Описание работы протоколов уровня Internet в стеке TCP/IP
 Адресная схема протокола IPv4
 Работа протокола транспортного уровня в стеке TCP/IP
 Лабораторная работа № 2-1 Инспекция пользовательских приложений
 Использование маршрутизаторов для подключения локальных сетей к Интернет
 Начальные конфигурации маршрутизаторов
 Лабораторная работа № 2-2 Начальное конфигурирование маршрутизаторов
 Использование Cisco Discovery Protocol (CDP)
 Лабораторная работа № 2-3 Конфигурирование CDP
 Изучение процессов доставки пакетов
 Лабораторная работа № 2-4 Конфигурирование default-gateway
 Лабораторная работа № 2-5 Изучение процесса передачи пакетов
 Использование статической маршрутизации
 Лабораторная работа № 2-6 Конфигурирование статических маршрутов
 Изучение основных списков доступа
 Лабораторная работа № 2-7 Конфигурирование и проверка списков доступа
 Трансляция IPv4 адресов
 Лабораторная работа №2-8 Конфигурирование статической и динамической трансляции на пограничном маршрутизаторе
 Лабораторная работа № 2-9 Выявление и устранение проблем, возникающих при трансляции адресов
 Модуль 3. Построение локальных сетей среднего размера
 Введение в VLAN и Trunk
 Лабораторная работа № 3-1 Конфигурирование VLAN и Trunk
 Маршрутизация между VLAN
 Лабораторная работа № 3-2 Конфигурирование маршрутизатора для выполнения маршрутизации между VLAN
 Использование IOS для создания DHCP серверов
 Лабораторная работа № 3-3 Конфигурирование маршрутизатора в качестве DHCP сервера
 Лабораторная работа № 3-4 Выявление и устранение проблем, возникающих при автоматическом присвоении адресов
 Изучение протокола динамического обмена маршрутами RIP v2
 Лабораторная работа № 3-5 Конфигурирование RIP v2
 Лабораторная работа № 3-6 Выявление  устранение проблем в работе RIP v2
 Модуль 4. Управление сетевыми устройствами и введение в основы их безопасности
 Обеспечение безопасного доступа к устройству
 Лабораторная работа № 4-1 Повышение безопасности устройства при начальной конфигурации
 Лабораторная работа № 4-2 Ограничение удаленного доступа на устройство
 Усиление защиты устройств
 Лабораторная работа № 4-3 Конфигурирование и проверка работоспособности механизма Port Security
 Лабораторная работа № 4-4 Конфигурирование и проверка работоспособности протокола NTP
 Конфигурирование системных сообщений устройства
 Лабораторная работа № 4-5 Конфигурирование syslog
 Управление устройствами Cisco
 Модуль 5. Введение в IPv6
 Введение в базовые функции протокола IPv6
 Понимание работы протокола IPv6
 Лабораторная работа № 5-1 Конфигурирование соединения двух устройств с помощью IPv6
 Использование статических маршрутов в протоколе IPv6
 Лабораторная работа № 5-2 Конфигурирование статической маршрутизации в протоколе IPv6
 
 
 ICND 2. Использование сетевого оборудования Cisco
 
 Описание курса
 Курс ICND 2 фокусируется на работе с уже существующими сетями и их усовершенствовании. Практическая часть программы состоит из 23 лабораторных работ. Их результатом станут ваши умения проверять настройки сети, обеспечивать бесперебойную работу ее компонентов, настраивать безопасные подключения, а также находить и устранять проблемы в работоспособности сети. Вы получите понимание о построении расширяемых и глобальных сетей и сможете строить и обслуживать их. Аудитория курса: инженеры поддержки, сетевые инженеры, технические специалисты и сетевые администраторы.
 После курса вы сможете:
 Устранять неисправности работы технологий VLAN и Trunk
 Решать базовые неисправности работы IPv4 и IPv6-соединений
 Внедрять и устранять проблемы в работе протокола EIGRP в IPv4 и IPv6-сети
 Внедрять протокол OSPF и OSPFv3
 Конфигурировать WAN-соединения и GRE-туннели
 Управлять устройствами Cisco.
 Программа курса:
 Модуль 1. Построение и эксплуатация сети масштаба кампус среднего размера
 Выявление и устранения проблем в сетях масштаба кампус связанных с использованием  виртуальных локальных сетей (VLANs)
 Лабораторная работа № 1-1 Выявление и устранение проблем, связанных с использованием VLANs и trunks
 Повышение надежности работы сетей, построенных с использованием коммутаторов
 Лабораторная работа № 1-2 Конфигурирование Root Bridges, и анализ топологии сети, образованной работой протокола STP
 Лабораторная работа № 1-3 Выявление и устранение проблем в сети, связанных с работой протокола STP
 Использование механизма Etherchannel в сетях, построенных с использованием коммутаторов
 Лабораторная работа № 1-4 Конфигурирование и проверка работоспособности Etherchannel
 Обеспечение надежности работы сети на третьем уровне модели OSI
 Лабораторная работа № 1-5 Конфигурирование и проверка работы протокола HSRP
 Лабораторная работа № 1-6 Выявление и устранение проблем в сети, связанных с работой протокола HSRP
 Модуль 2. Выявление и устранение проблем в базовых сетевых соединениях
 Описание процедур выявления и устранения сетевых проблем
 Лабораторная работа № 2-1 Использование различных инструментов для выявления и устранения сетевых проблем
 Лабораторная работа № 2-2 Конфигурирование и проверка работоспособности расширенных списков доступа для протокола IPv4
 Лабораторная работа № 2-3 Выявление и устранение проблем в сетевых соединениях для протокола IPv4
 Выявление и устранение проблем в сетевых соединениях для протокола IPv6
 Лабораторная работа № 2-4 Конфигурирование и проверка работоспособности расширенных списков доступа для протокола IPv6
 Лабораторная работа № 2-5 Выявление и устранение проблем в сетевых соединениях для протокола IPv6
 Модуль 3. Использование протокола EIGRP в корпоративных сетях
 Внедрение протокола EIGRP для протокола IPv4
 Лабораторная работа № 3-1 Конфигурирование и проверка работоспособности протокола EIGRP
 Внедрение протокола EIGRP для протокола IPv6
 Лабораторная работа № 3-2 Конфигурирование и проверка работоспособности протокола EIGRP для протокола IPv6
 Выявление и устранение сетевых проблем, связанных с использование протокола EIGRP
 Модуль 4. Построение расширяемых сетей с использованием протокола OSPF
 Основные принципы работы протокола OSPF
 Лабораторная работа № 4-1 Конфигурирование и проверка работоспособности протокола OSPF в одной области
 Основы построения OSPF домена при работе в нескольких областях
 Лабораторная работа № 4-2 Конфигурирование и проверка работоспособности протокола OSPF в нескольких областях
 Основные принципы работы протокола OSPF версии 3 для протокола IPv6
 Лабораторная работа № 4-3 Конфигурирование и проверка работоспособности протокола OSPF версии в нескольких областях
 Выявление и устранение сетевых проблем, связанных с использование протокола OSPF
 Лабораторная работа № 4-4 Выявление и устранение сетевых проблем, связанных с использование протокола OSPF
 Модуль 5. Глобальные сети
 Обзор технологий построения глобальных сетей
 Обзор работы протокола РРР
 Лабораторная работа № 5-1 Конфигурирование сериальных интерфейсов и протокола РРР
 Лабораторная работа № 5-2 Конфигурирование и проверка работоспособности Multi-Link PPP
 Лабораторная работа № 5-3 Конфигурирование и проверка работоспособности PPPoE client
 Использование GRE туннелей
 Лабораторная работа №5-4 Конфигурирование и проверка работоспособности GRE туннелей
 Использование протокола BGP для подключения к сети сервис провайдера
 Лабораторная работа № 5-5 Конфигурирование и проверка работоспособности протокола EBGP для подключения к одному сервис провайдеру
 Модуль 6. Управление сетевыми устройствами
 Принципы управления сетевыми устройствами, и обеспечение безопасности
 Лабораторная работа № 6-1 Конфигурирование внешней аутентификации с использованием протоколов TACACS+ и  RADIUS
 Повышение интеллектуальности сетей
 Введение в "качество обслуживания"
 
 
 
 */
