//
//  DEVOPS.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/* DEVOPS
 
 Курс DevOps — это комплексная программа обучения методологии DevOps, в ходе которой студенты с нуля осваивают данное направление. Этот курс — полноценная подготовка к профессии DevOps Engineer.DevOps Engineer — это одно из самых популярных и перспективных направлений на прогрессирующем IT-рынке. Эта специальность объединяет в себе сразу и навыки разработчика, и навыки администратора систем. Процесс DevOps инженерии очень важен на всех этапах, начиная от разработки идеи и заканчивая эксплуатацией готового продукта. В процессе обучения слушатели научатся пользоваться основными инструментами и методиками DevOps, изучат основные принципы хранения данных, рассмотрят совместную модель ответственности, шифрование, непрерывную интеграцию и другие аспекты DevOps инженерии.
 После изучения курса Вы сможете:
 Разбираться в процессах разработки программного обеспечения
 Уверенно работать с различными системами управления базами данных
 Знать современные технологии и методики DevOps, правильно выбирать нужную
 Использовать в работе основные DevOps-практики и активности
 Автоматизировать производственные процессы и проводить их стандартизацию
 Разрабатывать безопасную инфраструктуру для внедряемого программного обеспечения
 
 
 DevOps (базовый)
 
 Описание курса
 Вас интересует такое популярное и прогрессирующее направление в IT-индустрии, как методология DevOps? Хотите узнать больше о данной области и научиться правильно использовать DevOps-активности в своей работе? Тогда этот курс - именно то, что нужно. В процессе обучения вы научитесь эффективно планировать и строить инфраструктуру для разработки программного обеспечения. На каждом занятии вы будете закреплять свои навыки и знания в отрасли проектирования и построения безопасной среды для разрабатываемого программного обеспечения.

 После курса вы сможете:
 Разбираться в современных технологиях и методиках DevOps
 Внедрять в свою работу основные DevOps-практики и технологии
 Уверенно работать с различными инструментами при внедрении DevOps-практик
 Создавать и оптимизировать безопасную среду для разработки программного обеспечения
 Автоматизировать и стандартизировать производственные процессы
 Программа курса:
  

 1 модуль
 Определение DevOps. Культура DevOps. SRE vs DevOps engineers
 Agile. Scrum. Kanban. SDLC
 Оргвопросы. Личный кабинет. Домашние задания. Телеграм. Гугл доки.
  

 2 модуль
 GitHub. GitHub flow.
 Containers. Docker. Building and running docker containers,  part 1
  

 3 модуль
 Docker, part 2
 Что такое CI/CD
 Обзор существующих инструментов
  

 4 модуль
 Jenkins
  

 5 модуль
 Обзор существующих систем оркестрации
 Automation and Orchestration with Ansible
 AWS Intro. Обзор ключевых сервисов.
  

 6 модуль
 EC2, IAM
 Autoscaling, VPC
  

 7 модуль
 Infrastructure as code
 Automate AWS infra creation with cloudformation
  

 8 модуль
 Cloudfront, Route53, S3, ELB
  

 9 модуль
 Monitoring with Cloudwatch and Grafana. Loggin with ELK(elasticsearch+logstash+kibana)
  

 10 модуль
 Финальное задание. Развертывание инфраструктуры из кода.
  

 11 модуль
 SRE practice
 Тестирование инфраструктуры.
 Gamedays
 Disaster recovery plans
 Post mortems
 
 DevOps (продвинутый)
 
 
 Описание курса
 Курс предназначен для DevOps-практиков, желающих углубить свои знания в этой сфере. На курсе мы более детально познакомимся со всеми активностями DevOps-инженеров и уделим больше времени практическим вопросам. После курса вы будете готовы к выполнению более сложных рабочих задач и будете увереннее себя чувствовать в роли DevOps-инженера.
 После курса вы сможете:
 Понимать принципы разработки программного обеспечения
 Создавать инфраструктуру как код с помощью Terraform
 Понимать и комбинировать основные сервисы AWS
 Внедрять CI/CD-процессы в своей повседневной работе
 Создать production ready окружение на базе AWS ECS с полноценным логирование и сбором метрик.
 Упаковывать любые приложения в Docker и разворачивать с его помощью dev/prod окружения
 Программа курса:
 Модуль 1
 Определение DevOps. Культура DevOps.
 Agile. Scrum. Kanban
 Орг вопросы. Домашки. Телеграм. Гугл доки.
 Модуль 2
 GitHub. GitHub flow.
 Containers. Docker(part 1)
 Модуль 3
 Docker(part 2)
 Что такое CI/CD
 Обзор существующих инструментов
 Обзор DroneCI и TravisCI
 Модуль 4
 Jenkins
 Основы Jenkins pipelines
 Модуль 5
 Обзор существующих систем оркестрации
 Automation and Orchestration with Ansible
 Модуль 6
 AWS Intro. Обзор ключевых сервисов.
 EC2, IAM.
 Модуль 7
 Infrastructure as code
 Automate AWS infra creation with Terraform(part 1)
 Модуль 8
 Terraform(part 2)
 Autoscaling, VPC
 Модуль 9
 Cloudfront, Route53, S3, ELB
 Модуль 10
 Loggin with ELK(elasticsearch+logstash+kibana)
 Lambda functions
 Модуль 11
 Monitoring with Prometheus
 Модуль 12
 Обзор микросервисной архитектуры
 AWS ECS. Setup production ready ECS cluster with logging and monitoring.
 Модуль 13
 Финальное задание. Развертывание сложной инфраструктуры из кода.
 Модуль 14
 SRE practice
 Тестирование инфраструктуры.
 Gamedays
 Disaster recovery plans
 Post mortems
 
 
 
 */
