//
//  GameDevelopment.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 GAME DEVELOPMENT
 
 
 Game development —  комплексная программа обучения для людей, желающих заниматься разработкой игр. Курс ориентирован на разработчиков, владеющих C# на уровне выше среднего и художников, знакомых с Adobe Photoshop на начальном уровне. Roadmap посвящен изучению особенностей работы с игровым редактором Unity3D, а также всем аспектам цифровой живописи, созданию окружения, бекграундов и концепт-артов персонажей.
 После изучения курса Вы сможете:
 Работать с инструментарием движка Unity3D
 Создавать и публиковать собственные приложения
 Использовать инструменты Adobe Photoshop для CG арта
 Разрабатывать концепт-арт персонажей и динамические сцены
 Понимать психологию цвета, формы и философию подхода к созданию игры
 
 -----------------------------
 
 
 Unity3D
 
 Описание курса
 Курс рассчитан на людей, уже знакомых с С# как минимум на среднем уровне, имеющих небольшой опыт программирования, а также на младших Unity3D специалистов. По завершению курса полученных знаний будет достаточно для того, чтобы устроиться Junior+/начинающим Middle специалистом в любую киевскую компанию. После изучения теоретической части студенты будут разбиты на 2 группы для создания небольшой 2D игры с использованием полученных знаний.
 После курса вы сможете:
 Работать с основными элементами редактора Unity3D
 Самостоятельно создавать игровое приложение и размещать его в маркете
 Проходить собеседования на Junior+ Unity3d разработчика в ведущие игровые студии Киева
 Правильно структурировать архитектуру игры
 Вместе дешевле
 
 
 Геймдизайн
 
 
 Описание курса
 Геймдизайн —  программа обучения, направленная на получения знаний в области игровой разработки. Геймдизайнеры являются генераторами идей для новых игр, создателями и вдохновителями будущих шедевров индустрии компьютерных развлечений.

 В ходе курса вы получите базовые представления о работе геймдизайнера, освоите основы разработки игр и их структуры. Вы научитесь понимать логику создания компьютерной игры, узнаете о пользовательском опыте и ожидании аудитории. На курсе вы создадите свой собственный дизайн-документ.

 После курса вы сможете:
 Понимать подходы к созданию игр;
 Разбираться в сеттинге, персонажах, игровой механике;
 Учитывать требования пользователей при разработке игры;
 Настраивать игровой процесс и баланс;
 Работать с командой разработчиков.
 Программа курса:
 Гейм дизайнер работает с бумагой

 Определение понятия геймдизайна как рода деятельности.
 Навыки, которыми должен обладать гейм дизайнер.
 Что делает гейм дизайнер. Определение опыта, создаваемого гейм-дизайнером
 Что такое игра?

 Что такое игры. Чем игры отличаются от игрушек.
 Фан - что это.
 Игровые жанры.
 Игровые платформы.
 Из чего состоит игра

 Составные части игры - четыре основных элемента.
 Основные игровые элементы.
 Влияние игровых элементов на создаваемый опыт.
 Генерация идей

 Откуда берутся идеи.
 Как генерировать идеи и при помощи чего
 Красть и делиться - хорошо или плохо?
 Совместная генерация идей с аудиторией
 Выбор темы игры
 Постановка проблемы.
 Улучшения и фильтрация идей для подгонки к своей теме.
 Методы итерации.
 Игровые механики и прототипирование

 Игровые движки
 Игровые механики, что это и как их комбинировать
 Методы и принципы прототипирования
 Примеры создания прототипов
 Игры делаются для игроков

 Пользовательский опыт
 Целевая аудитория
 Ориентация на пользователя
 Основы игрового процесса

 Правила игрового процесса
 Принципы построения игрового процесса
 Кривые игрового процесса
 Ориентация на навык игрока
 Шансы и вероятности

 Шансы и вероятности в игровом процессе
 Примеры подсчета вероятностей в играх
 Основы игрового баланса

 Игрового баланс и его типы
 Основы игровой экономики
 Игровые интерфейсы

 Принципы построения игровых интерфейсов
 Восприятие процессов внутри игры через интерфейсы.
 Закрепление на практике знаний по построению интерфейсов.
 Кривые интереса - пост-оценка

 Объяснение что такое кривые интереса
 Оценка достигнутых результатов в своих идеях при помощи кривых интереса
 История и сюжет

 Игровые сюжеты и сюжетные линии
 Влияние сюжетов на игровой сеттинг
 Построение игровых сюжетов в рамках придуманных слушателями идей.
 Персонажи

 Главные и второстепенные игровые персонажи
 Специфика характеров игровых персонажей
 Влияние персонажей на сюжет и игровые механики
 Пространство мира

 Мироустройство и сэттинг
 Принципы построения миров
 Основы левел дизайна
 Эстетика мира

 Принципы придания миру “жизни”
 Значение анимаций и эффектов при создании опыта
 Звуковое сопровождение и его влияние на пользовательский опыт
 Команда и работа с ней

 Как работать с коллективом разработчиков
 Специфика каждого из отделов разработчиков
 Подведение итогов

 Подведение итогов курса и проверка результатов
 
 
 
 
 
 */
