//
//  DigitalMarketing.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation
/*
 DIGITAL MARKETING
 
 Digital Marketing —  комплексная программа обучения для желающих изучить современные приемы разработки и внедрения маркетинговых стратегий. Курс ориентирован как для людей, желающих углубить познания в интернет маркетинге, так и для новичков в этой сфере. В ходе обучения вы узнаете все об особенностях digital инстументов и углубите собственные познания о способах их внедрения. Вы сможете освоить построение кампаний и продвижение брендов при помощи методов контекстной рекламы, e-mail-маркетинга и грамотного копирайтинга.
 После изучения курса Вы сможете:
 Анализировать конкуренцию на рынке
 Понимать психологию аудитории и работать, исходя из ее потребностей
 Продвигать продукты и услуги с помощью контекстной рекламы
 Применять современные подходы ведения грамотного e-mail-маркетинга
 Создавать автоматические сценарии писем
 Создавать, структурировать и редактировать собственные тексты
 
 
 Social Media Marketing (SMM)
 
 Описание курса
 Курс Social Media Marketing на примере Facebook и Instagram научит вас использовать социальные сети для продвижения продукта. Благодаря разбору практических кейсов, в процессе обучения вы будете шаг за шагом учиться решать проблемы бизнеса при помощи соцсетей. Занятия позволят с нуля приобрести навыки анализа целевой аудитории, выявления ее потребностей и формирования под них индивидуальных стратегий продвижения и настройки рекламных кампаний. Курс будет полезен как для опытных специалистов, так и для начинающих свой путь в digital. Материал максимально комфортно структурирован и дает возможность без труда получить необходимые знания
 После курса вы сможете:
 Формировать SMM-стратегию продвижения бизнеса, исходя из потребностей ЦА;
 Настраивать, запускать и администрировать рекламные кампании;
 Управлять репутацией компании и формировать комьюнити.
 
 
 Creative & Copywriting
 
 Описание курса
 На курсе Copywriting & Creative мы овладеем техниками создания идей и разберемся как превращать идеи в креативный рекламный продукт, в частности в тексты. Рассмотрим, как устроен хороший текст, поработаем над выразительной лексикой. Научимся распознавать лишнее и правильно расставлять акценты. Заглянем за кулисы психологического восприятия текста. А еще дадим совет различным его формам: от слоганов и нейминга к сторителлингу и написанию сюжетов видеороликов. Мы подготовили для вас горячее: современные подходы копирайтинга, тренды, актуальные кейсы и много практических задач. А главное, в конце курса у вас будет собственный кейс, который вы сможете добавить в портфолио. Курс пригодится новичкам в копирайтинге. А также тем райтерам, которые до сих пор не писали рекламные тексты и не имели дела с созданием креативных идей, продают.
 После курса вы сможете:
 Разрабатывать креативные продающие идеи
 Писать сильно
 Создавать тексты для различных каналов коммуникации
 Программа курса:
 Лекция 1. Homo scriptoris и миф о креативности (2:00)
 Знакомство и коррекция ожиданий от участников курса
 Креатор, райтер, копирайтер, контент-менеджер
 Творчество VS Креативность
 Текст. Рекламный текст
 Муза креатора и где ее искать
 Работа с реальными кейсами
 Домашнее задание
 Лекция 2. Путь идеи от брифа до key visual & key message (2:00)
 Что бриф за зверь и как его едят?
 Инсайт - как попасть и не потерять
 Миссия найти идею (брейншторминг и другие методики и техники генерирования идей, тестирование идей)
 RAM
 key visual & key message - общие правила игры
 Работа с реальными кейсами
 Домашнее задание
 Старт работы над курсовым проектом
 Лекция 3. Психология влияния текста и изображение в рекламе (2:00)
 Как мозг воспринимает информацию и как это можно использовать
 LC4MP
 Рептильный, рациональный и эмоциональный мозги
 Понятие красоты и принцип «длинный тонкий»
 4S еще действует?
 Теория НЛП и психолингвистика
 Работа с реальными кейсами
 Домашнее задание
 Продолжение работы над курсовым проектом
 Лекция 4. Роль изображения в рекламном сообщении (2:00)
 Изображения VS текст = постер? (артдиректорский и копирайтерский подходы)
 Типы графических материалов рекламы и их особенности
 Как идея становится конкретным изображением?
 Этапы работы над «вижуалом» и разработка ТЗ для дизайнера
 Роль цвета
 Роль шрифта
 Роль архетипов
 Визуальные тренды
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 5. Текст в рекламном сообщении от мала до велика. Мало. 2:00
 Нейминг (типы, подходы к созданию, добрый и злой нейминг)
 Слоганы (типы, подходы к созданию и формулы, добрые и злые слоганы)
 Заголовок (законы заголовкотворення и смертные грехи)
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 6 . Текст в рекламном сообщении от мала до велика. Велико. (2:00)
 Малая и большая форма РП - когда какую?
 Структура СП: лед, зачин, топик-модули, эхо-фраза, кода
 Структура статьи: пирамида Минто и работа с модулями
 Структура PR-релиза
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 7. Текст, который тебя любит - выразительность, образность и лаконичность (2:00)
 Ритмика
 Художественные средства
 Фигуры речи
 Вербальные тренды
 Сушка. Как слить воду?
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 8. Тексты в digital. SMM-копирайтинг (2:00)
 От SMM-стратегии к контент-плану
 Типы контента и визуального формата
 Текст для соцсетей: пропустить нельзя - прочитать! (правила, ошибки и тренды)
 Тексты и Вижуал для платной рекламы в SMM (особенности форматов)
 Активация (механики, которые true & идеи, которые все love)
 Работа с OL (кто пишет и что с этим делать?)
 Работа с реальными кейсами
 Домашнее задачи
 Работа над курсовым проектом
 Лекция 9. Тексты в digital. Видеоролики и баннерная реклама - storytelling is a king! (2:00)
 ТВ vs digital
 От идеи до синопсиса
 Сторителинг (функция, законы, развитие сюжета, драма, персонажи и роль продукта)
 Работа над сценарием (сценарий, сториборды, Аниматика)
 Роль копирайтера в съемочном процессе
 Баннерная реклама - кино в миниатюре (типы , правила, роль текста и изображения, особенности сторителингу и драмы)
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 10. Тексты в digital. Сайты, спецпроекты, mobile apps и новые форматы (чат-боты, VR / AR, phygital) (2:00)
 Веб-сайты (типа, составляющие, роль и правила рекламных текстов)
 Спецпроекты в Инет-СМИ (зачем, как и что писать )
 Mobile apps (типы и правила рекламных текстов)
 Чат-боты (которые, зачем и как для них писать)
 Виртуальная реальность - возможности для рекламы, специфика работы
 Phygital - идеи, которые объединяют мира
 Презентация как реклама идеи (правила, фишки и тренды)
 Работа с реальными кейсами
 Домашнее задание
 Работа над курсовым проектом
 Лекция 11. Защита курсовых проектов и подведение итогов (2 часа)
 
 
 E-mail-маркетинг
 
 Описание курса
 Курс E-mail-marketing —  это обучение созданию электронных рассылок, которые являются лучшим инструментов повторных и дополнительных продаж. Уроки доносят до начинающих маркетологов основы создания качественных объявлений с соблюдением этикета e-mail-рассылок. Вы сможете изучить способы привлечения аудитории, повышения лояльности к бренду и продукту. Курс станет незаменимым базисом для новичков, которые желают с нуля освоить принципы e-mail-маркетинга, а действующим маркетологам он поможет систематизировать и углубить знания
 После курса вы сможете:
 Анализировать инструменты email маркетинга и создавать письма для рассылки
 Превращать посетителей сайта в подписчиков, а затем клиентов
 Создавать автоматические сценарии писем (триггеры)
 Анализировать и понимать основные показатели эффективности email рассылок
 Формировать эффективную команду для запуска email рассылок и контролировать подрядчиков
 Программа курса:
 Введение в e-mail-маркетинг
 Зачем бизнесу нужен e-mail-маркетинг?
 Выбор сервиса рассылок
 Как не попасть в спам?
 Какую рассылку выбрать: ручную или автоматическую?
   Сбор базы для рассылки
 Где взять подписчиков?
 Инструменты сбора подписчиков и сервисы
 Превращаем посетителей сайта в подписчиков
 Как получить подписчиков из оффлайн каналов
 Виды форм подписок и где их размещать
 Что такое лид магнит и как с ним работать
 Как проводить правильные эксперименты при сборе контактов на сайте
   Сегментация: отправляем правильные письма правильным людям
 Зачем сегментировать базу контактов и какие есть подходы
 Как сегментация влияет на увеличение продаж
 Сегментация в сервисе рассылок и как ее организовать
 Стратегия развития сегментов от подписчика до клиента
   Типы писем для рассылок
 Welcome серия
 Промо рассылки: скидки, акции, распродажи
 Письма после совершения покупки
 Триггерные письма
 Письма для реанимации клиентов
   Пошаговое создание письма
 Почему шаблон письма должен повторять стиль сайта: логотип, цвета, меню
 Что такое Preheader и зачем он нужен?
 Специальные символы в теме письма – нужно ли их использовать
 Хорошая тема письма: какой она должна быть
 Как написать текст продающего письма?
 Структуры письма, шрифты, цвета
 Как правильно вставлять картинки
 Кнопки и ссылки – сколько и как размещать
 Как оформить footer письма
 UTM метки – что это и зачем они нужны
 Нужно ли отправлять тестовые письма
 Отправка письма
   Создаем автоматические сценарии писем
 Работа с посетителями, которые сделали заказ, но не оплатили
 Работа с клиентами, которые положили товар в корзину, но не оформили заказ (интернет-магазины)
 Работа с постоянными клиентами – повторные продажи
 Мультиканальные сценарии: e-mail, смс, вайбер, пуш-уведомления
   Анализ эффективности рассылок
 Основные показатели эффективности e-mail-рассылок: open rate, click rate, CTR
 Доставляемость писем
 Отчеты в системах отправки рассылок
 Данные Google Analytics
   Команда для запуска e-mail-рассылок
 Кто должен заниматься e-mail-маркетингом
 Нужно ли привлекать к работе программистов
 Копирайтер и дизайнер – а нужны ли они
 Где взять наполнение письма (предложение, акция, скидка)
 Как правильно вести переговоры с заинтересованными лицами и руководством
 Какие KPI ставить в своей работе
 
 Digital-стратегия
 
 
 Описание курса
 Курс digital-стратегия откроет вам дверь в мир цифрового стратегического маркетинга. Обучение ставит своей целью посвятить слушателя в особенности работы с цифровыми каналами коммуникации. Вы сможете изучить принципы создания стратегии продвижения, овладеете приемами брендостроения, а также научитесь анализировать целевую аудиторию и вести маркетинговую политику, исходя из потребностей ЦА. Курс поможет интернет-маркетологам систематизировать свои знания, а для новичков он станет базисом для дальнейшего обучения и начала карьеры. Разобранные в ходе курса темы являются основоположными знаниями для начинающих маркетологов.
 После курса вы сможете:
 Строить маркетинговую стратегию на основании глубокого анализа рынка
 Определять и сегментировать целевую аудиторию, определять ее потребности
 Выбирать правильные и необходимые каналы продвижения, которые будут максимально релевантными для достижения поставленных целей
 Программа курса:
  
 Введение в digital
  
 Различия digital от других маркетинговых инструментов
 Тренды digital в мире и Украине
 Преимущества digital-инструментов
  
 Стратегия и планирование
  
 Digital-стратегия и этапы ее создания. маркетинговый анализ
 Фреймворки создания digital-стратегии
 Разработка ценностного предложения
  
 Основные digital-каналы в маркетинге и принципы работы с ними
  
 SMM
 Email маркетинг
 SEO / SEM
 Контент-маркетинг
 Контекстная реклама
  
 Big Data и аналитика в мире digital
  
 Анализ данных для различных digital-каналов
 Инструменты для сбора и анализа данных
 Оперирования аналитическим данным, влияние аналитики на стратегические решения
  
 Бренд
  
 Понятие бренда
 Модель бренда
 Основные бренд-стратегии
 Ключевые этапы построения успешного бренда
 
 Курс контекстной рекламы
 
 
 
 Описание курса
 Курс Google Adwords позволит вам изучить все особенности работы с этим сервисом запуска контекстной рекламы. Обучение построено по принципу “от простого к сложному”: вы начнете с настройки аккаунта с нуля и постепенно дойдете до запуска и администрирования рекламных проектов. Курс станет отправной точкой для карьеры в digital для начинающих свой путь в интернет-маркетинге. Он позволит обрести фундаментальные для новичков скилзы эффективного управления рекламным бюджетом, прицельного таргетинга, глубокой аналитики и дальнейшей оптимизации действующих рекламных кампаний.
 После курса вы сможете:
 Планировать стратегию продвижения в контекстной сети Googlе
 Снижать стоимость клика, путем правильного подбора ключевых слов
 Правильно анализировать эффективность рекламных кампаний
 Оптимизировать бюджеты и планировать KPI`s
 
 Программа курса:
 Введение
 Обзор возможностей и преимущества контекстной рекламы
 Виды контекстной рекламы
 Выбор правильной стратегии при создании рекламной кампании
 Что такое контекстная реклама
 Что такое контекстно-медийная сеть Google
 Подготовка к запуску рекламных кампаний
 Работа с сайтом перед запуском рекламных кампаний
   Начало работы с Adwords
 Создание аккаунта в Adwords, что учитывать при первичной настройке
 Как работать с основными показателями качества: Quality score, CTR, Landing pages
 Секреты ценообразования. Как платить меньше и размещаться выше.
 Какой вариант оплаты рекламы наиболее выгодный.
   Подбор ключевых слов
 Типы ключевых слов, типы запросов
 Эффективная работа с планировщиком ключевых слов
 Работа с семантическим ядром. Подбор ключевых слов — прогноз бюджета
 Работа с семантическим ядром. Добавление ключевых слов и минус-слов
   Создание и настройка рекламной кампании в контекстно-медийной сети Google
 Особенности работы в контекстно-медийной сети. Возможности.
 Форматы и типы объявлений.
 Правила создания эффективных объявлений
 Виды и типы таргетинга. Способы выбора аудиторий.
 Минус-таргетинг, исключение мест размещения
   Создание и настройка рекламной кампании в поисковой сети Google
 Группы объявлений. Тонкости правильной разбивки на группы.
 Настройка таргетинга продвижения
 Стратегия назначения ставок
 Правила создания эффективных объявлений
 Динамические поисковые объявления. Принципы работы
 Работа с расширениями
 Динамическая вставка ключевых слов.
   Использование редактора Adwords Editor   Ремаркетинг в Google Adwords
 Как повторно обращаться к посетителям вашего сайта. Базовые понятия.
 Правильная настройка ремаркетинга.
 Стратегии ремаркетинга. Индивидуальный подход к вашим посетителям
 Настройка ремаркетинга в контекстно-медийной сети Google
 Настройка ремаркетинга в поисковой сети Google
   Google Analytics. Вебвизоры.
 Основные метрики Google Analytics
 Интеграция данных  Google Adwords и Google Analytics: аудитории, списки ремаркетинга и др.
 Настройка базовых целей в Google Analytics
 Расширенные сегменты
 Основные способы оптимизации рекламных кампаний, отслеживание эффективности. KPIs
 Составление KPIs бизнеса и рекламы
 Показатели трафика
 Формирование отчетов.
 
 
 */
