//
//  HumanResourceManagement.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation
/*
 HUMAN-RESOURCE-MANAGEMENT
 
 УПРАВЛЕНИЕ ПЕРСОНАЛОМ
 
 Управление персоналом —  комплексная программа обучения подбору кадров и созданию благоприятной атмосферы в коллективе. Курс ориентирован на людей, имеющих опыт в рекрутинге / Human Resources и желающих повысить свои профессиональные навыки. Вы узнаете современные подходы к анализу рынка труда, методах мотивации персонала. Курс посвящен практическим аспектам процесса подбора кадров, мотивации действующих сотрудников и созданию уникального опыта.
 После изучения курса Вы сможете:
 Изучать рынок труда
 Быстро и эффективно обрабатывать резюме
 Разбираться в IT-тематике для проверки технической готовности кандидатов
 Находить правильный подход к вознаграждению и обучению сотрудников
 Мотивировать сотрудников
 
 IT-рекрутинг
 
 Описание курса
 Хотите больше углубиться в IT-тематику, изучить всю первичную терминологию и научиться искать и находить ценные кадры для прогрессирующей сферы информационных технологий? Тогда этот курс - именно то, что Вам нужно. В процессе обучения вы ознакомитесь с профессией рекрутера, узнаете подробнее о стадиях рекрутингового процесса, разберетесь в тонкостях активного и пассивного поиска кандидатов и многое другое. Программа обучения построена таким образом, чтобы пройденный теоретический материал сразу же закреплялся на практике, посредством работы с различными документами HR специалистов.
 После курса вы сможете:
 Максимально эффективно изучать рынок труда
 Правильно обрабатывать резюме кандидатов
 Грамотно проводить предварительный отбор кандидатов
 Хорошо разбираться в IT-тематике и быть с кандидатами “на одной волне”
 Проводить эффективные собеседования и закрывать вакансии
 Программа курса:
 Место рекрутера в IT-сфере
 Знакомство с профессией Рекрутера
 Роли в современных компаниях
 Профессиональные компетенции
 Перспективы профессии
 Карьерные возможности
 Виды компаний на современном рынке
 Что из себя представляет современный IT-рынок
 Стартапы
 Продуктовые компании
 Аутсорсинговые компании
 Аутстаффинговые компании
 Особенности внутреннего рынка Украины
 Кто есть кто в IT-сфере?
 Введение в IT
 Роли и виды специалистов
 Особенности профессий
 Техническая часть
 Front End
 Back End
 Quality Assurance
 Mobile
 Embedded
 Рекрутинговый процесс
 Стадии рекрутинга
 Сбор данных
 Составление профиля кандидата
 Работа с заказчиками
 Пассивный поиск
 Внутренний пул
 Создание вакансий
 Чек-лист или вакансии, которые продают
 Активный поиск
 Логический поиск
 Инструменты поиска
 Резюме кандидатов
 Опыт специалистов
 Компетенции
 Образование
 Правильное письмо кандидату
 Холодные кандидаты
 Первый контакт
 Работа с возражениями
 Собеседование кандидата
 Цели собеседования
 Виды интервью
 Этапы прохождения кандидата
 Эффективность работы рекрутера
 Аналитика данных
 Оффер кандидату. Что дальше?
 Работа с новыми сотрудниками
 Обзор работы HR/People Partner
 Экзамен
 
 HR management
 
 Описание курса
 Курсы менеджера по персоналу —  это программа обучения, в которой раскрываются все аспекты профессии HR, которые будут полезны как новичкам, так и опытным специалистам. Во время обучения студенты рассматривают управление персоналом, этапы построения карьеры HR-специалиста, знакомятся с принципами стратегического планирования рабочей силы, изучают особенности проведения интервью с кандидатами и получают советы по его успешному завершению. Окончив курсы HR, выпускники еще больше углубляются в развитие HR и ресурсы для вдохновения.
 После курса вы сможете:
 Управлять процессом найма;
 Создавать уникальный опыт сотрудника;
 Эффективно мотивировать и развивать сотрудников;
 Вдумчиво подходить к вопросам вознаграждения и обучения.
 Программа курса:
 Кто такой менеджер по персоналу: модель компетенций
 Что такое HR? Функции HR
 Компетенции HR
 Развитие в сфере HR
 Менеджер по персоналу как основной бизнес-драйвер
 Анализ рынка IT: глобальный, украинский
 Основные бизнес-модели в IT
 Организационная структура и внутренние процессы в компании.
 Формы сотрудничества в IT
 Трудовое законодательство Украины
 Соглашение о предоставлении услуг
 Соглашение о неразглашение коммерческой тайны
 Команды разработки в IT
 Методологии проектного менеджмента в IT
 Роли и позиции в команде разработки
 Введении в технологии в IT
 Веб\десктоп\мобильные приложения
 Бекенд\Фронтенд
 Тренды в технологиях
 Нетехнические направления в IT
 Жизненный цикл сотрудника
 Процесс отбора и найма: от интервью к офферу
 Адаптация сотрудников: эффективный онбординг
 Обучение и развитие: методы формирования культуры обучения в IT. Менторинг vs Коучинг
 Удержание: когда нужно удерживать, а когда увольнять
 Увольнение
 Оценка сотрудников
 Методы и подходы в оценке сотрудников
 Предоставление обратной связи
 Формирование культуры обратной связи в IT
 Компенсации и льготы
 Модели оплаты
 Должностные инструкции
 Вовлеченность и мотивация сотрудников
 Типы личностей и как с ними работать
 Мотивационные модели
 HR бренд
 Что такое бренд
 Разработка и внедрение EVP
 Как развивать бренд HR в организации
 Корпоративная культур
 Коммуникация в команде
 Основы ведения переговоров
 Работа сопротивлениями
 Конфликтные ситуации и как их разрешать
 
 
 
 */
