//
//  Management.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 BUSINESS ANALYSIS
 
 Менеджмент — программа обучения, направленная на повышение уровня знаний в области методологии бизнес-анализа и её применения с целью оптимизации и повышения эффективности бизнес процессов. Занятия по данному направлению будут полезными для представителей руководящих IT должностей, таких как: проектный менеджер, бизнес аналитик Team Lead, CEO, CFO и др.
 После изучения курса Вы сможете:
 Понимать принципы бизнес-анализа
 Находить пути внедрения новых стратегий деятельности предприятий
 Проводить инновационную политику в компании
 Оптимизировать деятельность компании для эффективной реализации бизнес-процессов
 
 
 Business Analysis base
 
 
 Описание курса
 Курс дает комплексные знания в области бизнес-анализа и ориентирован на желающих работать бизнес-аналитиком. Программа также будет полезна уже практикующим аналитикам.

 В основе курса - освоение технологий, позволяющих исследовать, моделировать и совершенствовать бизнес процессы компании.

 Большое внимание уделяется вопросам повышения эффективности и оптимизации, а также демонстрируется опыт внедрения изучаемых технологий в практику деятельности предприятий и организаций.

 После курса вы сможете:
 Уверенно понимать роли бизнес-аналитика, а также качества и навыки, необходимые для того, чтобы стать специалистом в области бизнес-анализа, включая рекомендации по их приобретению и развитию;
 Удачно использовать основные правила и приемы по созданию качественных документов, управлению бизнесом, моделированию бизнес-процессов, их оптимизации и организации внедрения изменений и инноваций в бизнесе
 
 
 Business Analysis Advanced
 
 
 Описание курса
 Данный курс предназначен для аналитиков, задачами которых является не просто выявление требований, но и организация работ и управление процессом бизнес-анализа в проектах создания ИТ-решений. Предполагается практическое использование популярной системы управления требованиями от компании Microsoft.

 В рамках расширенного курса закрепляются наиболее эффективные техники User Stories, проектирование предметной области, прототипирование пользовательского интерфейса.

 Особое внимание уделяется вопросам создания IT-решений в области работы с данными, построения систем визуализации, а также —  IT-продуктов с использованием машинного обучения.

 После курса вы сможете:
 Организовать управление IT-проектом в специализированной системе
 Более уверенно использовать техники User Stories, ERD, UI Prototyping
 Проектировать и реализовывать проекты BI аналитики
 Эффективно участвовать и инициировать проекты с применением технологий Data Science и Machine Learning
 Программа курса:
  

 Модуль 1: Прототипирование пользовательского интерфейса
  

 Mockup vs Wireframes
 Принципы прототипирования сценариев работы пользователей
 Создание ERD на основе UI-прототипов
 Прямое и обратное проектирование  в бизнес-анализе
  Workshop: Разработка UI на основе User Story
  Workshop: Разработка ERD на основе UI
  

  Модуль 2: Управление IT-проектами
  

 Цикл разработки ПО: SDLC
 Методологии управления проектами
 Техники приоритизации требований
 Управление требованиями и артефактами проекта
  Workshop: Использование системы управления ИТ проектом
 Cоздание и настройка аккаунта Azure DevOps
 Создание и структурирование требований в Azure Dev Ops
  

 Модуль 3: Бизнес анализ в проектах визуализации данных (BI Solutions)
  

 Введение в визуализацию данных и построение BI-решений
 Основные принципы проектирования BI-систем
 Лучшие практики при проектировании BI
 Платформы для самостоятельного изготовления BI-решений (Self Service BI)
 Обзор и демонстрация возможностей MS Power BI (бесплатная версия)
 Обзор и демонстрация возможностей Tableau (бесплатная версия)
 Workshop: Разработка и требований и прототипирование макета BI
  

 Модуль 4: Бизнес-анализ в проектах Data Science и машинного обучения
  

 Введение в Data Science
 Цикл разработки Data Science-проектов
 Этап Business Understanding как часть процесса проектов DSML
 Состав команды и необходимые навыки для бизнес-анализа
 Принципы и примеры проектов с применением машинного обучения
 Инструменты Business and Data Analyst
 Управление требованиями в Data Science-проектах
  Workshop: разработка требований для проекта Data Science
 
 
 
 */
