//
//  Cybersecurity.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation


/* КИБЕРБЕЗОПАСНОСТЬ
 
 Кибербезопасность базовый
 
 Описание курса
 Базовый курс по кибербезопасности для системных администраторов рассчитан на сотрудников IT-отделов, которые о кибербезопасности имеют фрагментарные или неструктурированные знания. Этот курс дает как теоретическую базу о фундаментальных принципах КБ, так и практические навыки в настройке и организации безопасной IT-инфраструктуры предприятия.
 После курса вы сможете:
 Понимать фундаментальные основы и базовые принципы инфраструктуры КБ, мировые практики и подходы в формировании киберзащиты предприятия
 Основные вызовы и угрозы IT-инфраструктуры
 Знать базовые принципы проведения кибернетических атак и пути противодействия
 Разбираться в основах криптографии, ее применении для защиты IT-инфраструктуры: PKI; IPsec; SSL
 Различать виды и методы аутентификации, организации централизованного управления разграничением доступа (LDAP, Radius, PKI)
 Применять АВПО, централизованное управление, обновление сигнатур. Разбираться в основах анализа ВПО
 Понимать принципы резервного копирования, его основные типы и отличия.
 На практике отрабатывать «усиления» IT-инфраструктуры: сетевое оборудование; управления паролями; сетевая инфраструктура
 Программа курса:
 Введение в КБ. Принципы кибернетической безопасности. Основы построения Защищенной IT-инфраструктуры
 Триада ИБ
 Понятие защищенного периметра IT-инфраструктуры. Демилитаризованная зона.
 Принципы построения защищенной IT-инфраструктуры.
 Комфорт vs. Безопасность
 Методы White/Black listing. Понятие, отличия, преимущества и недостатки.
 Критическая роль конечного пользователя в вопросах безопасности IT-инфраструктуры
 Модель OSI
 Международные руководящие документы в области кибербезопасности
 Принцип доверия
 Опасность использования ПО
 База данных общепринятых уязвимостей КБ
  
 Основные вызовы и угрозы IT-инфраструктуры
 Жизненный цикл кибернетических атак
 Понятие Vulnerability, Threat, Attack
 Типы кибернетических атак / угроз: DoS (DDoS), Reconnaissance, Phishing, MITM, Social engineering, Malware, Injections, Spoofing (Impersonification), Sniffing
  
 Основы криптографии
 Типы криптографических систем. Отличия. Преимущества, недостатки
 Методы шифрования данных в симметричных криптосистемах
 Хеширование
 Электронная цифровая подпись
 Механизмы согласования ключей шифрования
 Инфраструктура открытых ключей (PKI)
 Сетевые протоколы шифрования при передаче данных
  
 Организация защищенных виртуальных частных сетей
 Типы виртуальных частных сетей: Site-to-Site VPN, Remote access VPN, End-to-End VPN
 Применение механизмов туннелирования
 Основные протоколы туннелирования
 Прокси-серверы. Их типы, назначение и применение
  
 Виды и методы аутентификации, организация централизованного управления разграничением доступа, централизованный сбор и предварительный анализ событий безопасности
 Методы аутентификации. Их применение. Многофакторная аутентификация
 Авторизация, принцип наименьших привилегий
 Организация сбора событий и их предварительный анализ
  
 Применение антивирусного программного обеспечения с централизованным управлением политиками
 Комплексный подход в реализации современного АВПО
 Механизмы выявления ВПО
 Централизованно управления, обновления баз данных сигнатур и мониторинг политик. (На основе ERA server)
 Анализ ВПО (Sandbox, VirusTotal)
  
 Резервное копирование. Управление обновлениями и принципы их применения. Точки восстановления
 Концептуальные принципы и методы резервного копирования
 Принципы установки обновлений. Их проверка
  
 Усиление безопасности IT-инфраструктуры
 Политики безопасности на стороне конечного пользователя
 Сегментация сети
 Switch hardening (PortSecurity, ARP poisoning protection, etc)
 Router hardening (ACL, Neighbor discovery, Dynamic Routing Protection, etc)
 Защита почтового сервера
 Защита базовых сетевых сервисов (DNS, NTP etc.)
 Password management
 Защита WiFi-сетей
 BYOD
 
 
 
 
 */
