//
//  PMCourses.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 
 УПРАВЛЕНИЕ ПРОЕКТАМИ
 
 Управление проектами —  комплексная программа обучения правильному ведению проектов, управлению ресурсами команды и внедрению методологии Agile в проектном менеджменте. Руководство командой включает в себя множество аспектов тайм-менеджмента, делегирования задач, управления бюджетом, выбор инструментов и многое другое. На курсе вы научитесь правильно строить стратегию командной работы, разберете на примерах отличия методологий waterfall и scrum, а также способы их совмещения. .
 После изучения курса Вы сможете:
 Эффективно работать со своей проектной командой
 Работать с основными инструментами руководителя проекта
 Строить эффективные процессы разработки
 Правильно налаживать атмосферу в коллективе
 Корректировать деятельность команды на всех этапах выполнения проекта
 Внедрять Agile/Scrum методологию в проектах
 
 
 
 Project Management / CAPM
 
 
 После курса вы сможете:
 Знать суть и преимущества управления проектами и его элементы (термины, области знаний, процессы, жизненный цикл проекта и IT-продукта)
 Уметь оценивать влияние среды на проект и определять подход к управлению проектом, риски, работу с людьми и пр.
 Знать роль, функции руководителя проекта и требования к его компетенциям. Составить план развития своих компетенций
 Знать ключевые источники информации для эффективного управления проектом
 Знать ключевые входы и выходы процессов РМВОК®, последовательность применения процессов
 Выстраивать работу с заказчиком, спонсором, командой и другими заинтересованными сторонами
 Овладеть на базовом уровне ключевыми инструментами и методами управления проектом
 Работать с MS Project (или альтернативной системой) и JIRA
 Проводить коммуникации проекта, снижающие недоразумения, ошибки, потерю информации
 Работать с людьми, применяя базовые навыки эмоционального интеллекта, лидерства и влияния
 Знать, что входит в устав проекта, план управления проектом и другую базовую документов, а также зачем они нужны
 Анализировать бизнес-кейс проекта
 Понимать преимущества, сферы применения, специфику планирования и исполнения гибких/адаптивных проектов
 Подбирать подход к разработке: waterfall, agile, hybrid
 Планировать проекты: составлять реалистичные расписания и бюджет с учетом требований к продукту, качеству, коммуникациям, доступности и квалификации ресурсов и др. факторов
 Осуществлять мониторинг и контроль проекта, составлять отчетность, прогнозировать сроки и стоимость
 Проактивно работать с рисками проекта и повышать вероятность успешной реализации проекта, снижать количество проблем и непредвиденных ситуаций
 Планировать и контролировать закупочные работы проекта, оценивать влияние ключевых пунктов договоров на проект
 Применять базовые навыки формирования, развития и управления командой проекта
 Составить резюме руководителя проектов для поиска работы, применяя базовые принципы личного брендинга
 Получить необходимые часы обучения для допуска к экзамену на сертификацию CAPM® (PMI)
 
 
 Программа курса:
 Введение в управление проектами

 Введение в курс и CAPM® экзамен
 История, базовые понятия
 Проект, программа, портфель проектов и операционная деятельность компании
 Области управления проектом
 Группы процессов управления проектом
 Обзор подходов к управлению проектами
 Жизненный цикл проекта
 Документация по фазам жизненного цикла проекта
 Среда проекта и роль руководителя проектов

 Факторы среды организации
 Активы процессов организации
 Структура портфеля проектов в организации
 Функции руководителя проектов и его сфера влияния в организации
 Треугольник талантов руководителя проектов
 Инструменты руководителя проектов
 Лидерство и менеджмент в управлении проектом
 Инициация и планирование проекта

 Процессы, документация и инструменты фазы инициации
 Бизнес-кейс проекта
 Верхнеуровневая оценка параметров проекта
 Процессы, документация и инструменты фазы планирования
 Подготовка SOW и устава проекта
 Содержание проекта: ИСР, требования, описание
 Работа с MS Project или его аналогами
 Календарный план проекта
 Бюджет проекта
 Планирование качества, ресурсов и закупок в проекте
 Работа с заинтересованными лицами проекта
 Планирование коммуникаций в проекте
 Управление рисками проекта
 Базовый план проекта и план управления проектом
 Подготовка проекта к утверждению
 Специфика организации гибкого проекта
 Гибкое мировоззрение и agile manifesto
 Введение в scrum, XP, Kanban
 Планирование гибкого проекта
 Знакомство с JIRA
 Исполнение, мониторинг и контроль проекта

 Процессы, документация и инструменты
 Координация и контроль работ в проекте, работа с JIRA
 Подготовка статус-отчета по проекту
 Оценка результатов команды
 Работа с проблемами в проекте, эскалация
 Управление изменениями в проектах
 Запрос на изменение проекта
 Закрытие проекта

 Оценка результатов проекта
 Изученные уроки и ретроспектива проекта
 Финальный отчет
 Эмоциональный интеллект

 Принципы и этика работы руководителя проектов
 Экзамен (тест)
 Минимальные тр
 
 
 Project Management Professional / PMP
 
 
 Описание курса
 Курс Project management Professional от ITEA и PMI Kiev Chapter— это самая полная и системная подготовка для опытных руководителей проектов на основе стандарта PMBOK. Данный курс необходим всем, кто занимается управлением проектами и желает повысить свою квалификацию до профессионального уровня. Это курс для опытных руководителей проектов и всех, чья работа связана с повышением эффективности управления проектами организации - менеджерам портфелей проектов, руководителям проектных офисов и т.д. Программа данного курса полностью соответствует требованиям PMI для подготовки и допуска к экзамену на получение сертификата PMP® (Project management Professional®) от PMI. За прохождение курса вам будут начислены контактные часы, которые необходимы для доступа к PMP® экзамену. Детальнее о сертификации и экзамене можно ознакомиться по ссылке https://www.pmi.org/certifications/types/project-management-pmp).
 После курса вы сможете:
 Понимать связи между областями знаний, группами процессов PMBOK®, входами, выходами процессов
 Применять методы и инструменты PMBOK® в своих проектах
 Улучшить свои навыки управления проектами за счет адаптации документации, методов и инструментов PMBOK® к специфике организации, клиента, проекта
 Получить необходимые часы обучения для подачи заявки на сертификацию PMP® (PMI)
 Разработать план подготовки к экзамену на сертификацию PMP® (PMI)
 Программа курса:
 Модуль 1. Вводная часть, обзор экзамена РМР®
 Модуль 2. Основы управления проектами
 Проект и его характеристики, управление проектом и операционная деятельность; программа и портфель проектов; жизненный цикл проекта и продукта; фазы проекта; группы процессов и области знаний управления проектом; адаптация процессов; бизнес-кейс и план управления выгодами проекта, факторы среды организации и корпоративные активы процессов, виды организационных структур в компании, офис управления проектами, роль и функции руководителя проектов, технические знания, лидерство и предпринимательская смекалка руководителя проекта.
 Модуль 3. Инициация проекта
 Предварительная оценка проекта, проведение встреч, оценка целесообразности и реалистичности; определение ключевых результатов проекта и управление ожиданиями заинтересованных сторон; анализ заинтересованных сторон, рисков, предположений и ограничений проекта для разработки стратегии реализации проекта; устав проекта; оценка выгод и эффекта проекта; инструменты и техники оценки проекта; стратегическое управление.
 Модуль 4. Планирование проекта
 Обзор и оценка детальных требований, ограничений и предположений проекта; формирование содержание, календарного плана, бюджета и планов управления проектом по областям знаний: плана управления содержанием, затратами, сроками, ресурсами, коммуникациями, закупками, качеством, рисками; формирование плана управления изменениями и работы с заинтересованными сторонами; проведение стартовой встречи команды проекта; инструменты планирования затрат; виды контрактов и критерии их выбора; принципы бережливого производства; техники сбора требований; оценка влияния законодательства и окружающей среды; техники формирования содержания проекта, иерархическая структура работ, инструменты и техники составления календарного плана проекта; активное слушание, техники мозгового штурма, управление конфигурацией; техники сбора данных; принятие решений; техника экспертной оценки; фасилитация; инструменты управления информацией; навыки межличностной коммуникации; проведение встреч и переговоров, инструменты и техники презентаций, управление временем и расстановка приоритетов; принципы финансирования проектов; управление отношениями; техники оценки рисков; ситуационная осведомленность; техники работы с заинтересованными лицами, основы работы с MS Project или его аналогами.
 Модуль 5. Выполнение проекта
 Управление командой, внедрение изменений и корректирующих действий в проект, работа с рисками и проблемами, управление потоком информации в проекте, формирование и развитие отношений с заинтересованными лицами; процессы постоянного совершенствования; техники работы с контрактами и поставщиками, обеспечение качества, реализация эффекта проекта; коучинг, менторинг, обучение и техники мотивации команды; каналы, методы, инструменты и техники коммуникаций; работа с конфликтами; делегирование; разнообразие и культурные особенности в проекте; эмоциональный интеллект; управление знаниями; управление виртуальными/удаленными командами.
 Модуль 6: Мониторинг и контроль проекта
 Оценка хода проекта: инструменты и техники, управление изменениями в проекте, верификация результатов проекта, мониторинг и оценка рисков, журнал проблем проекта, изученные уроки, мониторинг закупочных работ; оценка производительности команды, анализ процесса, лимиты контроля проекта, принципы работы с финансами проекта, инструменты оценки качества, стратегии работы с рисками, техники валидации и верификации, техники управления изменениями; метрики оценки удовлетворенности клиента.
 Модуль 7: Закрытие проекта
 Финальный прием результатов проекта, их передача заинтересованным сторонам, финансовое, юридическое и административное закрытие проекта, подготовка финального отчета проекта, распространение изученных уроков по проекту, обратная связь; практики проверки соответствия требованиям, процедуры завершения процессов в проекте, техники обратной связи.
 Модуль 8. Основы управления гибкими проектами
 Гибкий жизненный цикл проекта; адаптация процессов под потребности компании, проекта и продукта; гибридные жизненные циклы проекта; гибкое мировоззрение и лидерство через служение; специфика планирования, реализации и закрытия гибких проектов; команды и роли в гибких проектах; управление изменениями в компании; гибкий офис управления проектами.
 Модуль 9. Профессиональная ответственность руководителя проектов
 Ответственность, уважительное отношение, честность и справедливость руководителя проекта в работе и жизни. Экзамен (тест) на проверку знаний.
 
 
 Agile/Scrum

 Описание курса
 Курс Agile/Scrum – это обучение гибкому мировоззрению, гибким подходам к разработке продукта и организации гибких проектов. Программа подходит как для тех, кто уже знаком на практике с данными методами и имеет опыт работы в гибких проектах, но столкнулся со сложностями их применения, так и для новичков, которые только планируют или начинают работать с Agile/Scrum. Освоение agile концепции и гибких практик позволит вам организовать проект более эффективно. Вы получите ответы на все вопросы, актуальные для начинающих проектных менеджеров, которые желают строить работу на базе Agile/Scrum. Курс ведут преподаватели из IT-компаний. Каждый урок даст возможность изучить новые тонкости использования гибкой методологии на практике. Вы узнаете, почему extreme programming повышает качество программного продукта и как использовать Agile/Scrum-подходы в конкретных целях и ситуациях.
 Обучение может проводиться на английском языке для практики навыков разговорной речи и терминологии.
 Программа данного курса позволяет глубоко вникнуть в руководство по скраму и подготовиться к тесту для получения сертификата PSM (I) (professional scrum master level I). Детальнее о сертификации и экзамене можно ознакомиться по ссылке https://www.scrum.org/professional-scrum-master-i-certification.

 После курса вы сможете:
 Применять Agile мировоззрение, его ценности и принципы на практике
 Говорить с практиками гибких подходов на одном языке
 Построить или улучшить процесс разработки по Scrum
 Получить рекомендации по получению сертификата PSM (I) и подготовиться к экзамену
 
 Программа курса:
 Знакомство с Agile

 Виды жизненных циклов проектов, их плюсы и минусы
 В каких проектах хорошо работают agile-подходы
 Специфика и эффект гибкого проекта
 Бизнес-кейс проекта и выбор подхода к его организации (практика)
 Обзор сертификаций по agile/scrum
 Agile мировоззрение

 Быть и делать agile: правильный подход к применению agile
 Что такое «гибкое мировоззрение»
 Agile manifesto: ценности и принципы гибких подходов
 Оценка гибкости компании (практика)
 Виды гибких практик

 Основы экстремального программирования
 Организация проекта по канбану
 Обзор скрам-фреймворка
 Практика скрама

 Фундаменты и ценности скрама
 Ролевая модель в скраме
 Артефакты скрама
 5 ключевых событий в скраме
 Деловая игра (скрам-лего)
 Работа с командами в скраме

 Принципы двусторонней коммуникации
 Модель эффективности коммуникаций
 Организация рабочего пространства
 Работа с виртуальной командой
 Модель командной динамики
 Оценка скорости работы команды (velocity), диаграмма сгорания работ
 Деловая игра (скрам-лего - продолжение)
 Роли руководителей в скраме

 Транзиция роли руководителя проектов
 Практика лидерства через служение
 Эмоциональный интеллект и гибкие навыки
 Скрам и организационные препятствия
 Постоянные улучшения
 4 уровня планирования скрам-проекта

 Подготовка бэклога продукта: пользовательские истории, приоритеты, высокоуровневая оценка
 Дорожная карта развития продукта
 Планирование релизов, скрам покер
 Планирование первой итерации
 Принципы проведения ежедневного скрама
 Чеклист по организации скрам-процесса
 Деловая игра (скрам-лего - завершение)
 Подводим итоги

 Открытый тест от Scrum.org
 Сессия вопросов и ответов
 Закрытие курса
 
 
 */
