//
//  VideoEditing.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation
/*
 
 ВИДЕОМОНТАЖ
 
 Видеомонтаж для начинающих
 
 Описание курса
 Видеомонтаж – это творческий процесс создания истории из разрозненных кусочков видео и фото. Мастерство монтажа позволит вам создавать красивые видеоролики, историю, которая полностью завладеет вниманием вашего зрителя. Много путешествуете, хотите поведать всему миру о ваших приключения? Хотите стать известным блогером, или снимать фильмы? Считаете, что мир индустрии кино для вас? Тогда начните создавать прекрасные видео ролики с помощью Adobe Premiere Pro. Благодаря курсу вы научитесь принципам и основам монтажа, узнаете, что такое рыба, цветокор, мастеринг. Обучитесь принципам анимации, узнаете, как не нужно делать и познаете все магические приемы монтажа. Сможете создать свое видео, не хуже, чем в Голливуде.
 
 
 После курса вы сможете:
 Пользоваться прогрессивной программой для видеомонтажа подходящей для пользователей Мас и PC
 Применять современные техники видеомонтажа
 Подбирать и управлять музыкой и звуками в монтаже
 Заниматься цветокоррекцией видео
 Использовать режиссуру монтажа и психологические приемы увлечения вашего зрителя или целевой аудитории
 Программа курса:
 Знакомство с Adobe Premiere Pro.
 Системные требования.
 Этапы монтажа.
 Структурирование материала.
 Форматы файлов и знакомство с программой Adobe Media Encoder.
 Настройка Premiere Pro «под себя».
 Теория монтажа
 Составные части фильма
 Типы склеек
 Эффект Кулешова
 Популярные приёмы монтажа
 Линейность события / Continuity
 Импорт материала.
 Организация проекта
 Ярлыки и бины
 Создание секвенции
 Видеомонтаж на панели Timeline. Скрытые возможности панели sequence
 Работа на панели Timeline
 Монтаж видео с готовых фрагментов
 Знакомство с полезными хоткеями и интересными функциями Premiere Pro
 Работа с аудио в Premiere Pro. Создание титров
 Видеоэффекты.
 Принципы анимации
 Работа с ключевыми кадрами
 Понятие видео эффектов
 Применение на практике
 Работа с масками.
 Понятие масок
 Применение
 Видео переходы их их типы.
 Цветокоррекция.
 Приемы и методика
 Голливудский стиль цветокоррекции
 Экспорт готового фильма
 Вывод готового материала
 Форматы кодирования
 
 */
