//
//  FrontendDevelopment.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/18/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 FRONTEND DEVELOPMENT
 
 Курсы верстки — комплексная программа обучения языкам HTML и CSS, HTML5 и CSS3, JavaScript и jQuery.
 Frontend-разработка — перспективное IT-направление, ведь даже начинающий Junior-фронтендщик может претендовать на месячный доход от 300 $. Такие специалисты востребованы как на биржах фриланса, так и в успешных IT-компаниях.
 Преподаватели ITEA – опытные разработчики топовых IT-компаний, создали эффективный практический курс для прокачки Hard Skills (основные знания и умения, которыми должен обладать продвинутый разработчик) и Soft Skills (базовые знания тайм-менеджмента и тимбилдинга, управление собственными задачами и проектами) . Roadmap Frontend development дает возможность комплексно овладеть специальностью разработчика с нуля.
 После изучения курса Вы сможете:
 Верстать сайты в HTML и CSS, HTML5 и CSS3
 Создавать и работать с переменными, используя JavaScript
 Проверять код на предмет ошибок в JavaScript
 Реализовывать несложные математические операции
 Создавать массив, функции, объекты, условные и цикличние конструкции
 Работать с библиотекой jQuery, используя все ее возможности
 
 
 */
