//
//  mobileDevelopment.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation

/*
 MOBILE DEVELOPMENT
 
 Roadmap мобильной разработки под iOS и Android от ITEA — это ваша возможность получить востребованную IT-профессию с нуля. Курсы выстроены в оптимальной для начинающих последовательности: от основ программирования (простые понятия переменных, циклов, массивов) до конкретных курсов по разработке под мобильные устройства разных платформ. Выбирайте отдельный курс или пройдите полную программу подготовки мобильного разработчика.Раньше мы удивлялись, если у компании не было сайта. Теперь одним из обязательных атрибутов успешного бизнеса можно назвать надёжное мобильное приложение, которое решает задачи клиентов. А значит, спрос на сильных специалистов в мобильной разработке будет расти.
 
 */
