//
//  php.swift
//  IteaIOSDip
//
//  Created by alexey sorochan on 11/17/19.
//  Copyright © 2019 alexey sorochan. All rights reserved.
//

import Foundation
/*
 
 php
 
 Курсы PHP — это комплексная двухуровневая программа обучения PHP,  после изучения которой вы сможете претендовать на вакансию Junior-специалиста и зарплату от 300 $/мес.
 Что такое PHP?
 Язык PHP – скриптовый язык программирования веб-приложений. Среда разработки PHP применяется для написания динамических веб-сайтов, социальных сетей, блогов, в сфере электронной коммерции. В качестве примеров, написанных на PHP, можно назвать Википедию, Facebook, Flickr, Twitter, WordPress, Drupal, а также фреймворки Zend, Symfony, Yii.
 PHP-разработчики успешно строят карьеру как на фриланс-биржах, так и в прогрессивных IT-компаниях.
 Roadmap PHP ведут специалисты-практики из крупнейших компаний, а уроки PHP  разработаны по принципу «минимум теории и максимум практики».
 После изучения курса Вы сможете:
 Проектировать архитектуру приложений
 Создавать и работать с базами данных
 Использовать основные паттерны проектирования при разработке программ
 Разрабатывать программы с использованием ООП-методологии и MVC-паттерна
 Использовать фреймворки и CMS-системы для разработки веб-приложений
 Управлять и настраивать веб-серверы
 Загружать и разворачивать проекты на веб-хостинге
 Работать PHP-программистом и в команде разработчиков, и на фрилансе
 Разбивать задачи на отдельные процессы, эффективно планировать время на выполнение задач
 
 
 
 
 */
